CSI API ETABS v1
cPropArea.GetSlabWaffle Method
 Retrieves property data for a waffle slab section.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSlabWaffle(
	string Name,
	ref double OverallDepth,
	ref double SlabThickness,
	ref double StemWidthTop,
	ref double StemWidthBot,
	ref double RibSpacingDir1,
	ref double RibSpacingDir2
)
Function GetSlabWaffle (
	Name As String,
	ByRef OverallDepth As Double,
	ByRef SlabThickness As Double,
	ByRef StemWidthTop As Double,
	ByRef StemWidthBot As Double,
	ByRef RibSpacingDir1 As Double,
	ByRef RibSpacingDir2 As Double
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim OverallDepth As Double
Dim SlabThickness As Double
Dim StemWidthTop As Double
Dim StemWidthBot As Double
Dim RibSpacingDir1 As Double
Dim RibSpacingDir2 As Double
Dim returnValue As Integer
returnValue = instance.GetSlabWaffle(Name,
	OverallDepth, SlabThickness, StemWidthTop,
	StemWidthBot, RibSpacingDir1, RibSpacingDir2)
int GetSlabWaffle(
	String^ Name,
	double% OverallDepth,
	double% SlabThickness,
	double% StemWidthTop,
	double% StemWidthBot,
	double% RibSpacingDir1,
	double% RibSpacingDir2
)
abstract GetSlabWaffle :
        Name : string *
        OverallDepth : float byref *
        SlabThickness : float byref *
        StemWidthTop : float byref *
        StemWidthBot : float byref *
        RibSpacingDir1 : float byref *
        RibSpacingDir2 : float byref -> int
Parameters
Name
Type: System.String
 The name of an existing waffle slab property.
OverallDepth
Type: System.Double
 Overall Depth
SlabThickness
Type: System.Double
 Slab Thickness
StemWidthTop
Type: System.Double
 Stem Width at Top
StemWidthBot
Type: System.Double
 Stem Width at Bottom
RibSpacingDir1
Type: System.Double
 Spacing of Ribs that are Parallel to Slab 1-Axis
RibSpacingDir2
Type: System.Double
 Spacing of Ribs that are Parallel to Slab 2-Axis
Return Value
Type: Int32
 The function returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim SlabType As eSlabType
       Dim ShellType As eShellType
       Dim MatProp As String
       Dim Thickness As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
       Dim OverallDepth As Double
       Dim SlabThickness As Double
       Dim StemWidthTop As Double
       Dim StemWidthBot As Double
       Dim RibSpacing1 As Double
       Dim RibSpacing2 As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new area property
       ret = SapModel.PropArea.SetSlab("MyShellProp1A", eSlabType.Waffle, eShellType.ShellThin, "4000Psi", 14.2)
   'set new area property
       ret = SapModel.PropArea.SetSlabWaffle(Name:="MyShellProp1A", OverallDepth:=11.1, SlabThickness:=22.2, StemWidthTop:=33.3, StemWidthBot:=44.4, RibSpacingDir1:=55.5, RibSpacingDir2:=66.6)
   'get area property data
       ret = SapModel.PropArea.GetSlab("MyShellProp1A", SlabType, ShellType, MatProp, Thickness, Color, Notes, GUID)
   'get area property data
       ret = SapModel.PropArea.GetSlabWaffle("MyShellProp1A", OverallDepth, SlabThickness, StemWidthTop, StemWidthBot, RibSpacing1, RibSpacing2)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace